{
  "data" : {
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of20.bin",
          "group1-shard2of20.bin",
          "group1-shard3of20.bin",
          "group1-shard4of20.bin",
          "group1-shard5of20.bin",
          "group1-shard6of20.bin",
          "group1-shard7of20.bin",
          "group1-shard8of20.bin",
          "group1-shard9of20.bin",
          "group1-shard10of20.bin",
          "group1-shard11of20.bin",
          "group1-shard12of20.bin",
          "group1-shard13of20.bin",
          "group1-shard14of20.bin",
          "group1-shard15of20.bin",
          "group1-shard16of20.bin",
          "group1-shard17of20.bin",
          "group1-shard18of20.bin",
          "group1-shard19of20.bin",
          "group1-shard20of20.bin"
        ],
        "weights": [
          {
            "name": "conv2d/kernel",
            "shape": [3, 3, 3, 64],
            "dtype": "float32"
          },
          { "name": "conv2d/bias", "shape": [64], "dtype": "float32" },
          {
            "name": "conv2d_1/kernel",
            "shape": [3, 3, 64, 64],
            "dtype": "float32"
          },
          { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
          {
            "name": "dense/kernel",
            "shape": [118336, 170],
            "dtype": "float32"
          },
          { "name": "dense/bias", "shape": [170], "dtype": "float32" },
          { "name": "dense_1/kernel", "shape": [170, 50], "dtype": "float32" },
          { "name": "dense_1/bias", "shape": [50], "dtype": "float32" },
          { "name": "dense_2/kernel", "shape": [50, 4], "dtype": "float32" },
          { "name": "dense_2/bias", "shape": [4], "dtype": "float32" }
        ]
      }
    ],
    "modelTopology": {
      "keras_version": "2.11.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [null, 180, 180, 3],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "conv2d_input"
              }
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                },
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling2D",
              "config": {
                "name": "max_pooling2d",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [2, 2],
                "padding": "valid",
                "strides": [2, 2],
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                },
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling2D",
              "config": {
                "name": "max_pooling2d_1",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [2, 2],
                "padding": "valid",
                "strides": [2, 2],
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Flatten",
              "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 170,
                "activation": {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                },
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 50,
                "activation": {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                },
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 4,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        }
      },
      "training_config": {
        "loss": "sparse_categorical_crossentropy",
        "metrics": [
          [
            {
              "class_name": "MeanMetricWrapper",
              "config": {
                "name": "accuracy",
                "dtype": "float32",
                "fn": "sparse_categorical_accuracy"
              }
            }
          ]
        ],
        "weighted_metrics": null,
        "loss_weights": null,
        "optimizer_config": {
          "class_name": "Custom>Adam",
          "config": {
            "name": "Adam",
            "weight_decay": null,
            "clipnorm": null,
            "global_clipnorm": null,
            "clipvalue": null,
            "use_ema": false,
            "ema_momentum": 0.99,
            "ema_overwrite_frequency": null,
            "jit_compile": true,
            "is_legacy_optimizer": false,
            "learning_rate": 0.0010000000474974513,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-7,
            "amsgrad": false
          }
        }
      }
    }
  }
}